Create a Python connection with SQL database and retrieve the results of the following queries as dataframes:

How many distinct (different) actors' last names are there?
Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.
Get all films with ARMAGEDDON in the title.
Get 10 the longest films.
How many films include Behind the Scenes content?
Which kind of movies (rating) have a mean duration of more than two hours?
Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [61]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

In [62]:
import getpass  # To get the password without showing the input

In [63]:
password = getpass.getpass()

········

In [64]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

In [68]:
#data = pd.read_sql_query('SELECT * FROM film', engine)
#data.head()

# 1

In [69]:

query = """
SELECT COUNT(DISTINCT last_name) AS distinct_last_names
FROM actor
"""


distinct_lastname = pd.read_sql(query, engine)

distinct_lastname

   distinct_last_names
0                  121

# 2

In [70]:
query1 = """ select rental_id, rental_date, monthname(rental_date) as month,
 dayname(rental_date) as weekday,
 case when dayofweek(rental_date) in (1,7) then 'weekend' else 'workday' 
 end as day_type
 from rental 

"""
weekday = pd.read_sql(query1, engine)
weekday

       rental_id         rental_date     month  weekday day_type
0              1 2005-05-24 22:53:30       May  Tuesday  workday
1              2 2005-05-24 22:54:33       May  Tuesday  workday
2              3 2005-05-24 23:03:39       May  Tuesday  workday
3              4 2005-05-24 23:04:41       May  Tuesday  workday
4              5 2005-05-24 23:05:21       May  Tuesday  workday
...          ...                 ...       ...      ...      ...
16039      13486 2006-02-14 15:16:03  February  Tuesday  workday
16040      15966 2006-02-14 15:16:03  February  Tuesday  workday
16041      11676 2006-02-14 15:16:03  February  Tuesday  workday
16042      14616 2006-02-14 15:16:03  February  Tuesday  workday
16043      11739 2006-02-14 15:16:03  February  Tuesday  workday

[16044 rows x 5 columns]

# 3

In [60]:
query2 = """   select  title from film 
where title like '%%ARMAGEDDON%%' """
armageddon = pd.read_sql(query2, engine) 
armageddon

#data = pd.read_sql("SELECT * FROM film.sakila where title like '%ARMAGEDDON ", engine)
#data

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

# 4

In [71]:
query3 = """ 

select title, length from film
order by length desc
limit 10

"""
top_10 = pd.read_sql(query3, engine)
top_10

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

In [56]:
#from sqlalchemy import text

#query = text("select title from film where title like :pattern")

# 5

In [75]:
query5= """select count(film_id) as number_of_films from film
where special_features like '%%Behind the Scenes%%';"""

b_h_s = pd.read_sql(query5,engine)
b_h_s

   number_of_films
0              538

# 6

In [78]:
query6="""select rating,avg(length) as  avgl 
from film  group by rating having avgl >120 ;"""
avl = pd.read_sql(query6, engine)
avl

  rating      avgl
0  PG-13  120.4439

In [ ]:
select title, length, RANK () OVER (Order by length desc) as length_rank
from film

# 7

In [79]:
query7 = """ select title, length, dense_rank()OVER (Order by length desc) as length_rank
from film
where length is not null and length > 0;"""

rank = pd.read_sql(query7, engine)
rank

                   title  length  length_rank
0          CHICAGO NORTH     185            1
1         CONTROL ANTHEM     185            1
2         DARN FORRESTER     185            1
3            GANGS PRIDE     185            1
4              HOME PITY     185            1
..                   ...     ...          ...
995         ALIEN CENTER      46          140
996            IRON MOON      46          140
997        KWAI HOMEWARD      46          140
998     LABYRINTH LEAGUE      46          140
999  RIDGEMONT SUBMARINE      46          140

[1000 rows x 3 columns]